Процедура ОтправитьМассивСообщенийElasticsearch(МассивСообщений) Экспорт
	
	АдресРесурса = "127.0.0.1";
	Порт = 9200;
	
	Для Каждого ТелоСообщения Из МассивСообщений Цикл
		Результат = ВыполнитьОтправкуПоHTTP(АдресРесурса, 
											ТелоСообщения, 
											ПолучитьСоединение(АдресРесурса, Порт));
	КонецЦикла;
	
КонецПроцедуры 

Функция ПолучитьСоединение(Сервер = Неопределено, Порт = Неопределено)
	Возврат Новый HTTPСоединение(Сервер, Число(Порт));
КонецФункции

Функция ВыполнитьОтправкуПоHTTP(АдресРесурса, ТелоСообщения, Соединение)
	РезультатОтправки = Новый Структура("УспехОперации, КодСостояния, РезультатОперации", Ложь, 418, "");
	Запрос = Новый HTTPЗапрос(АдресРесурса + "/_bulk/");
	Запрос.Заголовки.Вставить("Content-type", "application/json");
	Попытка
		Запрос.УстановитьТелоИзСтроки(ТелоСообщения, , ИспользованиеByteOrderMark.НеИспользовать);
		HTTPОтвет = Соединение.ОтправитьДляОбработки(Запрос);
		РезультатОтправки.Вставить("УспехОперации", Истина);
		РезультатОтправки.Вставить("КодСостояния", HTTPОтвет.КодСостояния);
		РезультатОтправки.Вставить("РезультатОперации", HTTPОтвет.ПолучитьТелоКакСтроку());
		Уровень = УровеньЖурналаРегистрации.Информация;
	Исключение
		РезультатОтправки.Вставить("РезультатОперации", ОписаниеОшибки());
		Уровень = УровеньЖурналаРегистрации.Ошибка;
	КонецПопытки;
	
	РезультатОтправкиСтрока = "";
	Для Каждого ЭлементСтруктуры Из РезультатОтправки Цикл
		РезультатОтправкиСтрока = РезультатОтправкиСтрока + Строка(ЭлементСтруктуры.Ключ) + ": " + Строка(ЭлементСтруктуры.Значение) + Символы.ПС;
	КонецЦикла;
	
	ЗаписьЖурналаРегистрации("Обмен с ElasticSearch. Ошибка выгрузки ", Уровень,,,РезультатОтправкиСтрока);
	
КонецФункции
