
&НаСервере
Процедура ОбработатьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка КАК guid,
	               |	Номенклатура.Представление КАК representation
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура";
	РезультатЗапроса = Запрос.Выполнить();
	МассивСообщений = СформироватьМассивJSON(РезультатЗапроса);
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ОтправитьМассивСообщенийElasticsearch(МассивСообщений);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СформироватьМассивJSON(РезультатЗапроса)
	
	МассивИменКолонок = Новый Массив;
	Для Каждого КолонкаРезультатаЗапроса Из РезультатЗапроса.Колонки Цикл
		МассивИменКолонок.Добавить(КолонкаРезультатаЗапроса.Имя);
	КонецЦикла;
	МаксимальноеЗначениеСчетчика = 100;
	МассивРезультат = Новый Массив;
	СчетчикИтераций = 0;
	СериализованноеЗначение = "";
	
	Выборка = РезультатЗапроса.Выбрать();
	
	
	Пока Выборка.Следующий() Цикл
		СчетчикИтераций = СчетчикИтераций + 1;
		СериализованноеЗначение = СериализованноеЗначение + "{ ""index"" : { ""_index"" : ""goods""}}" + Символы.ПС;
		ЗаписьJSON = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		Для Каждого ИмяКолонки Из МассивИменКолонок Цикл
			Если ИмяКолонки = "guid" Тогда
				Справочники.Номенклатура.НайтиПоКоду("").УникальныйИдентификатор();
				Значение = СтрЗаменить(Строка(Выборка[ИмяКолонки].УникальныйИдентификатор()), "-", "");
			Иначе 
				Значение = Строка(Выборка[ИмяКолонки]);
			КонецЕсли;
			
			ЗаписьJSON.ЗаписатьИмяСвойства(ИмяКолонки);
			ЗаписьJSON.ЗаписатьЗначение(Значение);
		КонецЦикла;
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СтрокаПараметровJSON = ЗаписьJSON.Закрыть();
		СериализованноеЗначение = СериализованноеЗначение + СтрокаПараметровJSON + Символы.ПС;
		
		Если СчетчикИтераций = МаксимальноеЗначениеСчетчика Тогда
			//Добавляем СериализованноеЗначение в МассивРезультат и очищаем СериализованноеЗначение
			СериализованноеЗначение = СериализованноеЗначение + Символы.ПС;
			МассивРезультат.Добавить(СериализованноеЗначение);
			СериализованноеЗначение = "";
			СчетчикИтераций = 0;
		КонецЕсли;
	КонецЦикла;
	
	Если СериализованноеЗначение <> "" Тогда 
		СериализованноеЗначение = СериализованноеЗначение + Символы.ПС;
		МассивРезультат.Добавить(СериализованноеЗначение);
	КонецЕсли;
	
	Возврат МассивРезультат;

КонецФункции

&НаКлиенте
Процедура Обработать(Команда)
	ОбработатьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура НайтиДокументыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НайтиДокументы(Команда)
	НайтиДокументыНаСервере();
КонецПроцедуры
